In [2]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
#Answer:

import pandas as pd
l = [4, 8, 15, 16, 23, 42]
df = pd.Series(l)

In [3]:
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the 
# variable print it.
# Answer : 
    
l1 = [1,2,3,4,5,6,7,8,9,10]
df1 = pd.Series(l1)

In [5]:
df1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [6]:
# Q3. Create a Pandas DataFrame that contains the following data:

#       Name          Age           Gender
#      Alice          25            Female
#      Bob            30            Male
#      Claire         27            Female

# Then, print the DataFrame.
# Answer :
    
df3 = pd.DataFrame({"Name" : ["Alice", "Bob", "Claire"],
                    "Age" : [25,30,27],
                    "Gender" : ["Female", "Male", "Female"]})

In [7]:
df3

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
Answer : In pandas , DataFrame is two-dimensional labeled data structure that represents a tabular data object 
        with rows and column and series is linear data structure. DataFrame is collections of series each column
        of DataFrame represents series.
        
        Example :

df4 = pd.DataFrame({"Name" : ["Alice", "Bob", "Claire"],
                    "Age" : [25,30,27],
                    "Gender" : ["Female", "Male", "Female"]})

Here: Name, Age and Gender is series of datas and df4 is DataFrame which is a collections of these series.

In [8]:
# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example 
# of when you might use one of these functions?
# Answer : some common functions you can use to manipulate data in a Pandas DataFrame:
#     1. head()
#     2. tail()
#     3. describe()
#     4. sort_values()
#     5. groupby
#Answer :

data = {'Name': ['John', 'Emma', 'Mike', 'Lisa', 'David', 'Rahul'],
        'Age': [25, 28, 22, 30, 35, 40],
        'Country': ['USA', 'Canada', 'UK', 'Australia', 'Germany', 'India']}
df5 = pd.DataFrame(data)

In [10]:
df5.head(3)

   Name  Age Country
0  John   25     USA
1  Emma   28  Canada
2  Mike   22      UK

In [ ]:
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
Answer : Series and DataFrame are mutable in nature and panel is non - mutable.

In [12]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.
# Answer :

names = pd.Series(['Chirag', 'Arpan', 'Nikhil', 'Tushar', 'Ankit', 'Prashant'])
age = pd.Series([20, 21, 20, 19, 22, 20])
intrest = pd.Series(['Noncore','Gate','Buisness','Call','stockmarket','Gate'])

df6 = pd.DataFrame({'Name' : names, 'Age' : age, 'Intrest' : intrest})

In [13]:
df6

       Name  Age      Intrest
0    Chirag   20      Noncore
1     Arpan   21         Gate
2    Nikhil   20     Buisness
3    Tushar   19         Call
4     Ankit   22  stockmarket
5  Prashant   20         Gate